app/controllers/categories_controller.rb

  def index
    @categories = current_city.categories.where(is_del: 0)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`is_del` = 0

  def show
    @price_rule = @category.get_price_rule(current_city)
    @products = @category.products.where(is_del: 0).paginate(page: params[:page], per_page: 10).order(updated_at: :desc)
---
SELECT  `products`.* FROM `products` WHERE `products`.`category_id` = 1 AND `products`.`is_del` = 0 ORDER BY `products`.`updated_at` DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `products` WHERE `products`.`category_id` = 1 AND `products`.`is_del` = 0

  def set_category
    @category = Category.find(params[:id])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1