app/controllers/user_addresses_controller.rb

SELECT `user_addresses`.* FROM `user_addresses` WHERE `user_addresses`.`user_id` = 1 AND `user_addresses`.`city_id` = 3
---
  def index
    @user_addresses = current_user.user_addresses.where(city: current_city)

INSERT INTO `addresses` (`address`, `lat`, `lng`, `comment`, `addressable_type`, `addressable_id`, `created_at`, `updated_at`) VALUES ('北京交通大学', 39.957945, 116.34935, '', 'UserAddress', 4, '2017-12-03 05:49:20', '2017-12-03 05:49:20')
---
  def create
    @user_address = UserAddress.new(user_address_params.merge(city: current_city, user: current_user))

    respond_to do |format|
      if @user_address.save

SELECT  `user_addresses`.* FROM `user_addresses` WHERE `user_addresses`.`id` = 3 LIMIT 1
---
    def set_user_address
      @user_address = UserAddress.find(params[:id])