app/views/layouts/_menu.html.slim

SELECT `cities`.* FROM `cities`
---
      		ul.dropdown-menu role='menu' aria-labelledby="dropdownMenu1"
        	 - City.all.each do |city|